Stella2211/StackChan/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_LANGUAGE_EN_US=y
CONFIG_BOARD_TYPE_M5STACK_STACK_CHAN=y
CONFIG_SEND_WAKE_WORD_DATA=n
CONFIG_SR_WN_WN9_HISTACKCHAN_TTS3=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# The WiFi/IP event handlers (managed_components/78__esp-wifi-connect) run on this
# task. HandleScanResult() + StartConnect() invoke the network-event callback, which
# in the custom-agent path formats log lines via fmt twice (hal_network's fmt::format
# -> agent onLog -> mclog::tagInfo). Two nested fmt passes (~500B inline buffer each)
# on top of the scan-result handling overflow the 4096B default -> "stack overflow in
# task sys_evt" when opening the AI Agent. 8192 gives comfortable headroom.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# Raised from the IDF default to give WireGuard's decrypted-frame path (posted to
# the TCPIP thread via tcpip_input) more headroom; see the MicroLink block below.
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
# Use the FULL newlib printf/scanf formatter, not "nano". The nano formatter does
# not understand the 'll' (64-bit) length modifier: 64-bit specifiers misprint as
# literal "ld"/"lu", and -- worse -- a "%s" that follows a "%llu" in the same format
# string reads a corrupted vararg pointer and crashes (LoadProhibited). MicroLink's
# logging uses %llu/%lld in many places (e.g. ml_wg_mgr.c process_disco_pong's
# "DISCO PONG from %s: RTT=%llu ms (via %s)"), so nano format faults during the
# Tailscale DISCO exchange. Full format costs ~tens of KB of flash but is correct.
CONFIG_LIBC_NEWLIB_NANO_FORMAT=n
CONFIG_CAMERA_GC0308=y
CONFIG_CAMERA_GC0308_DVP_YUV422_320X240_20FPS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_PLACEHOLDER=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# ===== MicroLink (Tailscale client) =====
# Routes the custom AI agent's backend WebSocket through a WireGuard tunnel so a
# tailnet-only backend (e.g. 100.x) is reachable. See main/agent/tailscale.cpp.
# Required by MicroLink / wireguard_lwip; the CONFIG_ML_* keys are simply unknown
# (ignored with a warning) until fetch_repos.py pulls the dependency.
#
# mbedTLS: Noise/WireGuard need ChaCha20-Poly1305 + HKDF; DERP & control plane
# use TLS 1.2 with the bundled CA roots for cert validation.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# lwIP: WireGuard adds a netif + extra sockets and posts decrypted frames to the
# TCPIP thread; give it more sockets and IPv4 reassembly. (LWIP_TCPIP_RECVMBOX_SIZE
# is raised to 64 at its single definition higher up in this file.)
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
# MicroLink tuning: size the peer table to hold the whole tailnet (WIREGUARD_MAX_PEERS=16
# is the hard ceiling) so the backend (priority peer) never has to evict an LRU peer and
# reuse its WG slot. With only 4 slots and a 13-node tailnet, the backend intermittently
# landed on a reused slot whose stale wireguard-lwip handshake state produced an INIT the
# peer couldn't validate -> device->backend handshake silently failed on some boots.
# Each ml_peer_t is ~288B in PSRAM, so 16 slots costs only ~3.5KB more than 4 (no SRAM hit).
# No built-in HTTP config server (we provision via NVS; saves ~28KB flash + ~7KB RAM
# and avoids a second :80 server clashing with WifiManager's config portal).
CONFIG_ML_MAX_PEERS=16
CONFIG_ML_ENABLE_CONFIG_HTTPD=n
